Revit 2027 API
UV.UnaryNegation Operator
Negates this 2-D vector and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static UV operator -(
	UV source
)
Public Shared Operator - (
	source As UV
) As UV
public:
static UV^ operator -(
	UV^ source
)
static let inline (-)
        source : UV  : UV
Parameters
source UV
Return Value
UV
The 2-D vector opposite to this vector.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The negated vector is obtained by changing the sign of each coordinate of the specified vector.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace